// Тестирование.
// Тестирование основного функционала: Тест1, Тест2, Тест3, Тест4.
//	КоличествоРезервныхКопий	ПериодХраненияРезервныхКопий
//	меньше параметра			меньше параметра				тест1
//	больше параметра			меньше параметра				тест2
//	меньше параметра			больше параметра				тест3
//	больше параметра			больше параметра				тест4
//
// Тест 1: Количество файлов меньше, чем минимальное количество резервных копий. Файлы младше даты удаления резервных копий.
// Ожидаем, что файлы удалены не будут.
// Настройка:
//		Каталог: "F:\dev\OneScript\deletebackupfiles\testing_dir\test1"
//		МинимальноеКоличествоРезервныхКопий: 5
//		ПериодХраненияРезервныхКопий: 7
// Файлы:
//		
// Тест 2: Количество файлов больше, чем минимальное количество резервных копий. Все файлы младше даты удаления резервных копий.
// Ожидаем, что файлы удалены не будут.
//
// Тест 3: Количество файлов меньше, чем минимальное количество резервных копий. Файлы старше даты удаления резервных копий.
// Ожидаем, что файлы удалены не будут.
//
// Тест 4: Количество файлов больше, чем минимальное количество резервных копий. Есть файлы старше даты удаления резервных копий.
// Ожидаем, что будут удалены самые старые файлы, но не более минимального количеств резервных копий
// и не позднее даты удаления резервных копий.
//
// Тестирование работы с настройками: Тест5, Тест6.
// Тест 5: Количество файлов больше, чем минимальное количество резервных копий. Есть файлы старше даты удаления резервных копий.
// Установлена настройка "БезУдаленияРезервныхКопий".
// Ожидаем, что в лог будут выведены самые старые файлы к удалению, но не более минимального количеств резервных копий 
// и не позднее даты удаления резервных копий.
// Файлы резервных копий удалены не будут.
//
// Файл настроек по умолчанию с настройкой "БезУдаленияРезервныхКопий".
// Файл настроек с удалением файлов резервных копий.
//
// Тест 6: Файла настроек по умолчанию не существует, переданного файла настроек не существует.
// Ожидаем, что файлы резервных копий удалены не будут.
//
// Тест 7: Файла настроек по умолчанию не существует, переданный файл настроек существует.
// Ожидаем, что будут удалены самые старые файлы, но не более минимального количеств резервных копий
// и не позднее даты удаления резервных копий.
//
// Тест 8: Файл настроек по умолчанию существует, переданного файла настроек не существует.
// Ожидаем, что файлы резервных копий удалены не будут.
//
// Тест 9: Файл настроек по умолчанию существует, переданный файл настроек существует.
// Ожидаем, что будут удалены самые старые файлы, но не более минимального количеств резервных копий
// и не позднее даты удаления резервных копий.
//
// Тест 10: Проверка заполнения настройки "Каталог".
// Ожидаем, что задание не будет выполнено, если не заполнена настройка "Каталог".
// Пока не знаю как проверить, кроме как смотреть лог.
//
// Тест 11: Проверка заполнения настройки "Каталог".
// Ожидаем, что задание не будет выполнено, если не указана настройка "Каталог".
// Пока не знаю как проверить, кроме как смотреть лог.
//
// Тест 12: Проверка заполнения настройки "МаскаФайлов".
// Ожидаем, что задание не будет выполнено, если не заполнена настройка "МаскаФайлов".
//
// Тест 13: Проверка заполнения настройки "ТекущаяДата".
// Ожидаем, что задание не будет выполнено, если не заполнена настройка "ТекущаяДата".
// Пока не знаю как проверить, т.к. нет доступа из вне к переменным модуля.
//
// Тест 14: Проверка существования каталога с резервными копиями.
// Ожидаем, что задание не будет выполнено, если указана "Каталог", который не существует.
// Пока не знаю как проверить, кроме как смотреть лог.
//
// Тест 15: Проверка, указанный каталога с резервными копиями является каталогом, а не файлом.
// Ожидаем, что задание не будет выполнено, если указана "Каталог", который является файлом, а не каталогом.
// Пока не знаю как проверить, кроме как смотреть лог.
//
// Тест16: Проверка при наличии в каталоге с резервными копиями каталогов, удовлетворяющих маске поиска.
// Ожидаем, что не будут удалены из каталога с резервными копиями каталоги, удовлетворяющие маске поиска.

#Использовать fs
#Использовать asserts

#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	ВсеТесты = Новый Массив;	
	ВсеТесты.Добавить("Тест1");
	ВсеТесты.Добавить("Тест2");
	ВсеТесты.Добавить("Тест3");
	ВсеТесты.Добавить("Тест4");
	ВсеТесты.Добавить("Тест5");
	ВсеТесты.Добавить("Тест6");
	ВсеТесты.Добавить("Тест7");
	ВсеТесты.Добавить("Тест8");
	ВсеТесты.Добавить("Тест9");
	ВсеТесты.Добавить("Тест10");
	ВсеТесты.Добавить("Тест11");
	ВсеТесты.Добавить("Тест12");
	//ВсеТесты.Добавить("Тест13");
	ВсеТесты.Добавить("Тест14_ПроверкаСуществованияКаталога");
	ВсеТесты.Добавить("Тест15_КаталогЭтоКаталогАНеФайл");
	ВсеТесты.Добавить("Тест16_ВКаталогеЕстьКаталогиУдовлетворяющиеМаске");
	
	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста() Экспорт
КонецПроцедуры

Функция РодительскийКаталог(Знач Каталог)
	РазделительПути = ПолучитьРазделительПути();
	Если Прав(Каталог, 1) = РазделительПути Тогда
		Каталог = Лев(Каталог, СтрДлина(Каталог)-1);
	КонецЕсли;
	ПозицияРазделителяПути = СтрНайти(Каталог, РазделительПути, НаправлениеПоиска.СКонца);
	Если ПозицияРазделителяПути > 0 Тогда
		Каталог = Лев(Каталог, ПозицияРазделителяПути-1);
	КонецЕсли;

	Возврат Каталог;
КонецФункции

Функция НовыйДанныеОКаталоге(Каталог = "")
	
	Данные = Новый Структура("КоличествоФайлов, Файлы", 0, Новый Массив);

	Если Не Каталог = "" Тогда
		НайденныеФайлы = НайтиФайлы(Каталог, ПолучитьМаскуВсеФайлы());
		Данные.КоличествоФайлов = НайденныеФайлы.Количество();
		СписокФайлов = Новый СписокЗначений;
		Для каждого НайденныйФайл Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(НайденныйФайл.Имя);
		КонецЦикла;
		СписокФайлов.СортироватьПоЗначению();
		Данные.Файлы = СписокФайлов.ВыгрузитьЗначения();
	КонецЕсли;

	Возврат Данные;

КонецФункции

Функция ОжидаемЧтоМассивыРавны(Массив1, Массив2, Знач ПредставлениеМассива1 = "", Знач ПредставлениеМассива2 = "")
	
	Если ПредставлениеМассива1 = "" Тогда
		ПредставлениеМассива1 = "Массив 1";
	КонецЕсли;

	Если ПредставлениеМассива2 = "" Тогда
		ПредставлениеМассива2 = "Массив 2";
	КонецЕсли;
	
	ПредставлениеУтверждения = СтрШаблон("Ожидаем, что массив %1 равен массиву %2", ПредставлениеМассива1, ПредставлениеМассива2);

	Ожидаем.Что(Массив1.Количество(), ПредставлениеУтверждения).Равно(Массив2.Количество());

	Количество = Массив1.Количество();
	Для Инд = 0 По Количество-1 Цикл
		Ожидаем.Что(Массив1[Инд], СтрШаблон("Ожидаем, что элементы массивов %1 равны", Инд)).Равно(Массив2[Инд]);
	КонецЦикла;

КонецФункции


Процедура ПодготовитьТест1(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test1"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,23);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест2(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test2"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*2;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*1;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест3(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test3"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест4(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test4"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест5(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test5"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест6(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест7(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings_manual.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test7"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест8(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test8"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест9(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test9"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файла настроек settings_manual.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings_manual.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test9"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест10(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": """",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест11(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест12(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test9"",
	|		""fullbackups.МаскаФайлов"": """",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест13(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": ""F:\\dev\\OneScript\\delete_backup_files\\testing_dir\\test9"",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
		ЗаписьТекста.Закрыть();
		Файл = Новый Файл(ПолныйПуть);
		Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
	КонецЦикла;

КонецПроцедуры

Процедура ПодготовитьТест14(Знач ФайлНастроек, Знач Каталог)
	
	УдалитьФайлы(Каталог);
	
	// Создание файла настроек settings.json.
	ЗаписьТекста = Новый ЗаписьТекста(ФайлНастроек);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": """+СтрЗаменить(Каталог, "\", "\\")+""",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Процедура ПодготовитьТест15(Знач ФайлНастроек, Знач Каталог)
	
	// УдалитьФайлы(Каталог);

	// Создание файла каталога.
	ЗаписьТекста = Новый ЗаписьТекста(Каталог);
	ЗаписьТекста.Закрыть();
	
	// Создание файла настроек settings.json.
	ЗаписьТекста = Новый ЗаписьТекста(ФайлНастроек);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": true,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": """+СтрЗаменить(Каталог, "\", "\\")+""",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 5,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 7
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();

КонецПроцедуры

Процедура ПодготовитьТест16(Знач Каталог)
	
	ФС.ОбеспечитьПустойКаталог(Каталог);
	
	// Создание файла настроек settings.json.
	ИмяФайла = ОбъединитьПути(Каталог, "settings.json");
	ЗаписьТекста = Новый ЗаписьТекста(ИмяФайла);
	ЗаписьТекста.Записать(
	"{
	|	""БезУдаленияРезервныхКопий"": false,
	|	""trade_fullbackups"":
	|	{
	|		""fullbackups.Каталог"": """+СтрЗаменить(Каталог, "\", "\\")+""",
	|		""fullbackups.МаскаФайлов"": ""trade_*"",
	|		""fullbackups.МинимальноеКоличествоРезервныхКопий"": 0,
	|		""fullbackups.ПериодХраненияРезервныхКопий"": 0
	|	}
	|}"
	);
	ЗаписьТекста.Закрыть();
	
	// Создание файлов резервных копий.
	ТекущаяДата = ТекущаяДата();
	
	НовыеФайлы = Новый ТаблицаЗначений;
	НовыеФайлы.Колонки.Добавить("Имя");
	НовыеФайлы.Колонки.Добавить("ВремяИзменения");
	НовыеФайлы.Колонки.Добавить("ЭтоКаталог");

	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_1.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,01);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "retail_backup_2.bak";
	НоваяСтрока.ВремяИзменения = Дата(2018,01,02);
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_2.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*8;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_3.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*7;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_4.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*6;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_5.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*5;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_6.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*4;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_7.bak";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*3;
	НоваяСтрока = НовыеФайлы.Добавить();
	НоваяСтрока.Имя = "trade_backup_1_catalog";
	НоваяСтрока.ВремяИзменения = ТекущаяДата - 86400*9;
	НоваяСтрока.ЭтоКаталог = Истина;
	
	Для каждого НовыйФайл Из НовыеФайлы Цикл
		ПолныйПуть = ОбъединитьПути(Каталог, НовыйФайл.Имя);
		Если НовыйФайл.ЭтоКаталог = Истина Тогда
			СоздатьКаталог(ПолныйПуть);
		Иначе
			ЗаписьТекста = Новый ЗаписьТекста(ПолныйПуть);
			ЗаписьТекста.Закрыть();
			Файл = Новый Файл(ПолныйПуть);
			Файл.УстановитьВремяИзменения(НовыйФайл.ВремяИзменения);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура Тест1() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test1";
	ПодготовитьТест1(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);
	// ДанныеОКаталогеЭталон.КоличествоФайлов = 6;
	// ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_1.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_2.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_3.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_4.bak");

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test1";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,07);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,07));
	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();

	УдалениеФайловРезервныхКопий.ОчиститьЗадания();

	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест2() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test2";
	ПодготовитьТест2(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);
	// ДанныеОКаталогеЭталон.КоличествоФайлов = 6;
	// ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_1.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_2.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_3.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_4.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_5.bak");
	// ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_6.bak");

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test2";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,07);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,07));
	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();

	УдалениеФайловРезервныхКопий.ОчиститьЗадания();

	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест3() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test3";
	ПодготовитьТест3(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test3";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,09);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,09));
	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();

	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест4() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	ПодготовитьТест4(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге();
	ДанныеОКаталогеЭталон.КоличествоФайлов = 8;
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("settings.json");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_3.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_4.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_5.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_6.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_7.bak");

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест5() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test5";
	ПодготовитьТест5(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест6() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test6";
	ПодготовитьТест6(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	УстановитьТекущийКаталог(ТекущийКаталог);

	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings_manual.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест7() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test7";
	ПодготовитьТест7(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге();
	ДанныеОКаталогеЭталон.КоличествоФайлов = 8;
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("settings_manual.json");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_3.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_4.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_5.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_6.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_7.bak");

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	УстановитьТекущийКаталог(ТекущийКаталог);

	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings_manual.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест8() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test8";
	ПодготовитьТест8(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	УстановитьТекущийКаталог(ТекущийКаталог);

	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings_manual.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест9() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test9";
	ПодготовитьТест9(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге();
	ДанныеОКаталогеЭталон.КоличествоФайлов = 9;
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("settings.json");
	ДанныеОКаталогеЭталон.Файлы.Добавить("settings_manual.json");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_3.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_4.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_5.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_6.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_7.bak");

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	УстановитьТекущийКаталог(ТекущийКаталог);

	ФайлНастроек = ОбъединитьПути(КаталогДляТеста, "settings_manual.json");
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки(ФайлНастроек);
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест10() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test10";
	ПодготовитьТест10(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест11() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test11";
	ПодготовитьТест11(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест12() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test12";
	ПодготовитьТест12(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

Процедура Тест14_ПроверкаСуществованияКаталога() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test14";
	КаталогНастроек = "F:\dev\OneScript\delete_backup_files\testing_dir";
	ФайлНастроек = ОбъединитьПути(КаталогНастроек, "settings.json");
	
	ПодготовитьТест14(ФайлНастроек, КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогНастроек);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

	УдалитьФайлы(ФайлНастроек);

КонецПроцедуры

Процедура Тест15_КаталогЭтоКаталогАНеФайл() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test15";
	КаталогНастроек = "F:\dev\OneScript\delete_backup_files\testing_dir";
	ФайлНастроек = ОбъединитьПути(КаталогНастроек, "settings.json");
	
	ПодготовитьТест15(ФайлНастроек, КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге(КаталогДляТеста);

	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогНастроек);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	
	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

	УдалитьФайлы(ФайлНастроек);

КонецПроцедуры

Процедура Тест16_ВКаталогеЕстьКаталогиУдовлетворяющиеМаске() Экспорт
	
	КаталогДляТеста = "F:\dev\OneScript\delete_backup_files\testing_dir\test16";
	ПодготовитьТест16(КаталогДляТеста);
	ДанныеОКаталогеЭталон = НовыйДанныеОКаталоге();
	ДанныеОКаталогеЭталон.КоличествоФайлов = 4;
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_1.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("retail_backup_2.bak");
	ДанныеОКаталогеЭталон.Файлы.Добавить("settings.json");
	ДанныеОКаталогеЭталон.Файлы.Добавить("trade_backup_1_catalog");
	
	// ИнфоТекущийСценарий = ТекущийСценарий();
	// РодительскийКаталог = РодительскийКаталог(ИнфоТекущийСценарий.Каталог);
	// ПодключитьСценарий(ОбъединитьПути(РодительскийКаталог, "delete_backup_files.os"), "УдалениеРезервныхКопий");
	// Тест = Новый УдалениеРезервныхКопий();

	// Каталог = "F:\dev\OneScript\delete_backup_files\testing_dir\test4";
	// МаскаФайлов = "trade_*";
	// МинимальноеКоличествоРезервныхКопий = 5;
	// ПериодХраненияРезервныхКопий = 7;
	// ТекущаяДата = Дата(2018,01,10);
	
	// УдалениеФайловРезервныхКопий.ДобавитьЗадание(КаталогДляТеста, "trade_*", 5, 7, Дата(2018,01,10));
	ТекущийКаталог = ТекущийКаталог();
	УстановитьТекущийКаталог(КаталогДляТеста);
	УдалениеФайловРезервныхКопий.ПрочитатьНастройки();
	УстановитьТекущийКаталог(ТекущийКаталог);

	УдалениеФайловРезервныхКопий.ЗаполнитьЗаданияИзНастроек();
	
	УдалениеФайловРезервныхКопий.УдалитьУстаревшиеРезервныеКопии();
	
	УдалениеФайловРезервныхКопий.ОчиститьЗадания();
	
	ДанныеОКаталоге = НовыйДанныеОКаталоге(КаталогДляТеста);
	
	Ожидаем.Что(ДанныеОКаталоге.КоличествоФайлов, "Ожидаем, что количество файлов равно "+ДанныеОКаталогеЭталон.КоличествоФайлов)
			.Равно(ДанныеОКаталогеЭталон.КоличествоФайлов);
	
	ОжидаемЧтоМассивыРавны(ДанныеОКаталоге.Файлы, ДанныеОКаталогеЭталон.Файлы, "ДанныеОКаталоге", "ДанныеОКаталогеЭталон");

КонецПроцедуры

